list_song = ['А не спеть ли мне песню', 'Арктика', 'Гореть', 'Гори', 'Искала', 'Контракт', 'Люби меня люби',
             'Парфюмер', 'Простая песня', 'Солдат', 'Три полоски', 'Я так соскучился']

list_com = ['Екатерина Черняева', 'Лавкин Кирилл', 'Настя Харлина', 'Анастасия Дудко', 'Кочеткова Анастасия',
            'Саблуков Сергей', 'Куликова Надежда Николаевна', 'Екатерина Покшин', 'Фатеев Сергей', 'Петрова Анастасия',
            'Елизавета Филоненко', 'Петров Даниил', 'Московцева Таня', 'Ганина Татьяна', 'Филимоничев Дмитрий',
            'Фомина Екатерина', 'Близнов Матвей', 'Романова Елизавета', 'Трушин Максим', 'Перепелицина Дарья',
            'Сергеев Дмитрий', 'Ларина Александра', 'Митина Юлия', 'Парфенюк Виктор', 'Гуреева Эвелина',
            'Винокуров Андрей', 'Ковалёва Мария', 'Паршков Егор', 'Сафонова Дарья', 'Старченков Кирилл',
            'Елизавета Филоненко', 'Родина Надежда', 'Петякина Анна', 'Черняева Екатерина', 'Кочеткова Анастасия',
            'Ханзюк Вероника', 'Осадец Алёна', 'Петров Даниил', 'Еримеев Даниил', 'Конин Владимир']

list_zod = {'водолей': [20, 50],
            'рыбы': [51, 80],
            'овен':[81, 111],
            'телец':[112, 141],
            'близнецы': [142, 172],
            'рак': [173, 202],
            'лев': [203, 233],
            'дева': [234, 264],
            'весы': [265, 294],
            'cкорпион':[295, 324],
            'стрелец':[325, 355],
            'козерог': [[356, 365], [1, 19]]}

list_zod_com = {'водолей': [['Сергеев Дмитрий', 50], ['Винокуров Андрей', 33]],
                 'рыбы': [['Екатерина Черняева', 68], ['Романова Елизавета', 74], ['Ковалёва Мария', 66], ['Родина Надежда', 74], ['Черняева Екатерина', 68], ['Ханзюк Вероника', 67]],
                 'овен': [['Лавкин Кирилл', 93], ['Настя Харлина', 99]],
                 'телец': [['Анастасия Дудко', 126], ['Перепелицина Дарья', 120], ['Сафонова Дарья', 131]],
                 'близнецы': [['Саблуков Сергей', 152], ['Митина Юлия', 149], ['Паршков Егор', 156], ['Кочеткова Анастасия', 143]],
                 'рак': [['Куликова Надежда Николаевна', 174], ['Екатерина Покшин', 180], ['Гуреева Эвелина', 202]],
                 'лев': [['Фатеев Сергей', 211], ['Петрова Анастасия', 230], ['Ганина Татьяна', 208], ['Близнов Матвей', 222], ['Конин Владимир', 203]],
                 'дева': [['Московцева Таня', 249], ['Трушин Максим', 242], ['Петякина Анна', 242]],
                 'весы': [['Парфенюк Виктор', 294]],
                 'cкорпион': [],
                 'стрелец': [['Елизавета Филоненко', 335], ['Филимоничев Дмитрий', 340], ['Фомина Екатерина', 340], ['Еримеев Даниил', 344]],
                 'козерог': [['Ларина Александра', 5], ['Старченков Кирилл', 9], ['Осадец Алёна', 7], ['Петров Даниил', 358]]}

list_zod_op = {'овен': 'Если ты родился под знаком Овна, то ты обладаешь искрой, неустанным движением и склонностью'
                       ' к преувеличению. Твоя любовь к приключениям и отсутствие скучных моментов связаны с влиянием'
                       ' Марса и Солнца. Ты не любишь подавленность и скучать, поэтому можешь проявлять'
                       ' эксцентричность. Но в то же время, ты заботишься о близких друзьях и можешь быть щедрым и'
                       ' любить делать подарки. Ты представляешь знак пионеров и изобретателей, которые любят'
                       ' прокладывать свою тропу. Но не забывай, что любопытство может перейти в нескромность и'
                       ' несдержанность. Если ты женщина-Овен, то ты любишь быть впереди моды и предпочитаешь яркие'
                       'цвета. Как мужчина-Овен, ты можешь проявлять первичную сырую энергию, что может привести к'
                       ' нетерпимости к другим людям, агрессии и разрушению. Но у тебя есть элемент "себя",'
                       ' самоутверждения, а также желание ответственности, самодраматизации и самоотречения. Так что не'
                       ' стоит спорить с тобой, Овен. В Рубине вы сможете раскрыть свои способности к необычному и'
                       ' нестандартному. Именно это станет вашей изюминкой, с помощью которой вы будете отличаться от'
                       ' окружающих',
               'телец': 'Ты, как Телец, обладаешь глубокими эмоциями и чувственностью, которые могут проявляться как в'
                        ' любви, так и в гневе. Ты стойкий и упрямый, но при этом справедливый и честный. Ты ценишь'
                        ' комфорт и красоту, поэтому создаешь уютную обстановку в своем доме и уделяешь внимание декору'
                        ' и интерьеру. Но иногда ты можешь быть немного жадным и упрямым, нужно учиться преодолевать'
                        ' свою нерешительность и желание сохранять статус-кво. В целом, ты - терпеливый, спокойный и'
                        ' уверенный человек, который любит комфорт и красоту. Ты можешь быть очень преданным и'
                        ' лояльным, и это одна из твоих сильных сторон. Благодаря своей эмпатии вы сможете чутко'
                        ' прочувствовать своих сотрудников в Рубине. Это поможет вам понять и осознать атмосферу в'
                        ' отряде, также Телец может развеять обстановку с помощью своего бойкого нрава.',
               'близнецы': 'Если ты родился под знаком Близнецов, то ты обладаешь разносторонним интеллектом,'
                           ' непредсказуемостью и склонностью к переменам. Твоя любовь к спорам и веселью связана с'
                           ' влиянием Меркурия. Ты стремишься располагать собой и организовывать свою жизнь в'
                           ' соответствии со своими интересами, но это может привести к неврастении и непостоянству. У'
                           ' тебя есть вкус к игре и подвижный ум, но иногда ты терпишь неудачу из-за разбрасывания. Ты'
                           ' чувствителен и эгоистичен, но приложив усилие и упорство, можешь добиться успеха.'
                           ' Женщины-Близнецы любят яркие цвета и пестрые ткани, а знак управляет нервной системой.'
                           ' Рожденные под ним обладают быстротой и реакцией, но могут страдать от непостоянства и'
                           ' неорганизованности. Ваше энергичность и позитив очень кстати нужна в Рубине. Вы с лёгкостью'
                           ' согласитесь на самые разные конкурсы и мероприятия, также организовать их. ',
               'рак': 'Если ты родился под знаком Рака, то ты обладаешь чувствительностью и эмоциональностью. Твоя'
                      ' память и интуиция очень сильны, но ты также склонен к мечтательности и самокопанию. Ты часто'
                      'ощущаешь неуверенность и нуждаешься в поддержке окружающих. Твоя любовь к дому и семье связана с'
                      ' влиянием Луны. Ты обладаешь тонким чувством юмора и способностью заботиться о других, но иногда'
                      ' можешь быть излишне застенчивым и неуверенным. Женщины-Раки обычно очень женственные и любят'
                      ' заботиться о своей внешности, а мужчины могут быть холеные и элегантные.',
               'лев': 'Ты любишь роскошь и деньги, но это не из-за эгоизма, а потому что ты стремишься создать'
                      ' комфортную жизнь для себя и своих близких. Ты можешь быть щедрым и готовым помочь другим, но '
                      'только если это не угрожает твоему статусу или достоинству. Ты лидер и умеешь вдохновлять и '
                      'мотивировать других, но иногда можешь быть слишком доминирующим и авторитарным.В целом, как'
                      ' Телец и Лев, ты обладаешь сильным характером и стремлением к комфорту и роскоши. Ты любишь быть'
                      'в центре внимания и получать признание за свои достижения. Однако, важно помнить о других людях '
                      'и не забывать о чувствах окружающих. Учись быть более терпимым и деликатным в общении с другими '
                      'людьми. Ваше целеустремлённость очень пригодится в Рубине, ведь только такие ребята могут'
                      ' достичь много(И не только в Рубине)',
               'дева': 'Дорогая Дева, ты один из самых интересных и уникальных знаков Зодиака. Твоя потребность в'
                       ' совершенстве и порядке отражается в твоем стиле одежды. Ты всегда выглядишь безупречно и'
                       ' аккуратно, предпочитая классический стиль с нейтральными цветами и аккуратными линиями. Твой'
                       ' образ всегда простой, но стильный и элегантный. Ты можешь быть более скромной и неприметной в'
                       ' своем стиле, предпочитая практичность и комфорт перед модными тенденциями. Твоя одежда может'
                       ' быть скромной и функциональной, без ярких цветов или вычурных деталей. Ты обращаешь внимание'
                       ' на детали и качество, стремишься к совершенству и порядку во всем, включая свой стиль одежды.'
                       ' Ты можешь быть консервативной и скромной, но всегда аккуратной и элегантной. Твоя потребность'
                       ' в чистоте и порядке может быть сравнима с потребностью кота. Ты беспокойна, хочешь все'
                       ' обдумать прежде, чем делать, и иногда это может приводить к потере шансов или возможностей.'
                       ' Ты умна, работоспособна и надежна, и можешь достичь любых высот. Так что продолжай быть верной'
                       ' себе, Дева, и продолжай воплощать свой стиль в одежде. Ты всегда будешь выглядеть прекрасно и'
                       ' элегантно. Ваш перфекционизм и способность доводить любое дело до конца сделает вас одним из '
                       'лидеров в отряде Рубина. Такие как вы способны на всё: от вырезание цветочков для декорации до'
                       ' организации самого маштабного мероприятия. ',
               'весы': 'Не бойся экспериментировать с одеждой и давай себе немного волшебства, мой друг. Используй свой'
                       ' аналитический ум, чтобы выбирать одежду, которая подчеркивает твои достоинства и скрывает'
                       ' недостатки. Не стесняйся добавлять яркие акценты и играть с разными стилями. Помни, что ты '
                       'заслуживаешь выглядеть на все сто! Ты, как Весы, знаешь, как завоевать людей вокруг себя:'
                       ' шармом, лаской, лестью, спонтанным гостеприимством, щедростью, великодушием и охотно'
                       ' оказываемыми услугами. Не забывай, что ты лучше работаешь над чужими идеями, улучшая их. И'
                       ' помни, что ты - вершина элегантности. Обращай внимание на покрой своей одежды и не бойся'
                       ' экспериментировать с цветами. Ты заслуживаешь только самого лучшего! Для всех вы остаётесь '
                       'загадкой, но именно в Рубине Весы смогут раскрыться. Вы скрываете от окружающих огромный '
                       'потенциал, поэтому не медлите и скорее проявляйте себя. Поверьте, окружающим понравится. ',
               'скорпион': 'Уважаемый Скорпион, вы - знак, который оказывает сильное влияние на окружающих. Ваш стиль'
                           ' является женственным, постоянным и неистовым. Вы обладаете ночной энергией, молчаливостью'
                           ' и изворотливостью. Ваш девиз - "Песнь любви на поле битвы". Вы управляемы Марсом и'
                           ' находитесь под влиянием Плутона, что придает вам некую плохую репутацию, связанную с '
                           'домом смерти. Однако вы обладаете огромной сопротивляемостью и способностью воскрешаться,'
                           ' как Феникс. Вы обладаете воинственными качествами и опасной энергией, как у Овна. Вы'
                           ' символизируете глубину души и индивидуализм. Ваша энергия связана с любовью и смертью,'
                           ' драмой, страстью, тайной и бунтом. Если вы женщина-Скорпион, то вы обладаете сильной'
                           ' работоспособностью и являетесь замечательным кулинаром. Вы активны, горды, сдержаны, '
                           'требовательны и любопытны. Ваша эмоциональность и открытость может помочь вам в игре на'
                           ' сцене. Вы можете прочувствовать множество ролей и успехов их реализовать. В Рубине как'
                           ' можно чаще выступайте на сцене.',
               'стрелец': 'Люди, рожденные под знаком Стрельца, могут быть умными и решительными, имеющими своих'
                          ' поклонников. Они могут быть и уверенными в себе и бесстрашными, достигая высокого '
                          'социального статуса, или же быть эгоистами. Многие из них любят путешествовать, как в'
                          ' реальности, так и в своих мыслях, а другие увлекаются коллекционированием. Они могут быть'
                          ' реформистами, желающими оставить свой след на земле и произвести впечатление на окружающих.'
                          ' Женщины-Стрельцы могут быть амазонками, стремящимися быть равными или даже превосходить'
                          ' мужчин в некоторых областях. Их стиль может варьироваться от спортивной одежды до роскошных'
                          'нарядов. Мужчины-Стрельцы также предпочитают качество в одежде и могут иметь различный стиль,'
                          ' от спортивного до франтового. Ваше желание проявить себя слишком сильное, что можете забыть'
                          ' про мнения окружающих. Но в Рубине мы ценим мнение каждого, поэтому помогайте не только '
                          'себе, но и окружающим раскрыть себя.',
               'козерог': 'Вы, как Козерог, предпочитаете классический и простой стиль одежды. Вам нравятся черные'
                          ' брюки, белая рубашка и черные туфли. Вы можете добавить некоторые аксессуары, чтобы придать'
                          ' своему образу индивидуальность, но не перегружаете свой стиль. Если вы женщина, то можете'
                          ' носить платья с простым кроем и нейтральными цветами. Вы можете добавить к ним некоторые '
                          'аксессуары, чтобы придать образу женственность, но не выбираете слишком яркие и вызывающие'
                          ' наряды. Вы также очень практичны в выборе одежды. Вы выбираете вещи, которые будут'
                          ' долговечными и удобными. Вам не важно, что они модные или красивые. Для вас главное, чтобы '
                          'они были функциональными и соответствовали вашим потребностям. В целом, вы можете быть'
                          ' довольно консервативными в своем стиле одежды. Вы не следуете модным тенденциям,'
                          ' если они не соответствуют вашему вкусу и стилю. Вы скорее предпочтете классический стиль,'
                          ' чем современный. В любом случае, вы будете выбирать одежду, которая подчеркивает вашу'
                          ' индивидуальность и достоинства. Ваша упёртость и интуиция помогут организовать ваш отряд в'
                          ' Рубине. Вы проявите себя как достойного лидера, который всегда поддерживает своих близких.',
               'водолей': 'Водолеи - комбинация ангела и дьявола, они не любят фальши и эффектов, но могут шокировать.'
                          ' Они приносят удовольствие, но в основном для себя. В семейных делах они придерживаются'
                          ' старомодных ценностей. Они стремятся к власти, статусу и престижу, но также хотят '
                          'освободиться от материальных обременений. Они любопытны и привлекаются новым, но могут быть'
                          ' религиозными и понимающими природу. Их вежливость - это простота, они могут быть'
                          ' доверчивыми и немного наивными. Они стремятся быть не только равными, но и превосходить'
                          ' других. Они могут быть эксцентричными и искать что-то редкое и уникальное. В профессии они'
                          ' могут быть сознательными, дисциплинированными и ответственными. Деньги их редко интересуют,'
                          ' они предпочитают простоту и умеренность. В Рубине очень ценятся простые и открытые люди. А '
                          'Водолеи превосходно владеют этими качествами. Вы можете отстоять свою точку зрения, но при'
                          ' этом уважаете мнения окружающих.',
               'рыбы': 'Вы, как Рыбы, комбинация ангела и дьявола. Не принимаете фальш и эффекты, шокируете окружающих.'
                       ' Наслаждаетесь жизнью для себя. Придерживаетесь традиционных ценностей в семейных делах.'
                       ' Стремитесь к власти, статусу и престижу, но хотите избавиться от материальных обязательств.'
                       ' Любопытны и привлекаетесь к новому, но можете быть религиозными и понимающими природу.'
                       ' Вежливы, доверчивы и наивны. Стремитесь превосходить других, ищете редкое и уникальное. В'
                       ' профессиональной сфере ответственны и дисциплинированы. Деньги редко интересуют, предпочитаете'
                       ' простоту и умеренность. С другой стороны, ищете свое "я" и можете ощущать себя неуверенными.'
                       ' Руководитесь скрытой стороной жизни и вас трудно понять. Можете быть уставшими и без энергии'
                       ' для преодоления препятствий. Интересуетесь всем, но специфическим образом. Редко чувствуете'
                       ' себя желанными и требуете подтверждения. Можете стать жертвами самих себя и других, погружаясь'
                       ' в страдания. Мистика и фантазия преобладают в выборе одежды, мало заботитесь о модных трендах. '
                       'В целом, как Рыбы, стремитесь к гармонии и пониманию, но можете быть сложными и трудно понять.'
                       ' Творческая натура Рыб открывают им все двери в искусство. А ведь рубин - это место творчества'
                       ' и саморазвития. Рубиновцам очень приятно общаться и находиться рядом с таким человеком.'
                       ' Вдохновляйте себя и окружающих во время нашей замечательной смены в Рубине. '}



